# Ex3 - Getting and Knowing your Data



### Step 1. Import the necessary libraries

In [6]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [7]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep= "|", index_col="user_id")   #todo archivo que las separaciones son algo se llama csv

In [8]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [9]:
df.set_index("user_id") #esto se usa en caso de que no lo hayas puesto al leer el archivo

KeyError: "None of ['user_id'] are in the columns"

### Step 4. See the first 25 entries
Solve it by 2 different ways

In [ ]:
df.iloc[0:25, :]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [ ]:
df.loc[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [ ]:
df[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [ ]:
df.iloc[-10:, :]

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [ ]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [ ]:
df.loc[len(df)-9:]

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?
Solve it by 2 different ways

In [ ]:
#observaciones son las filas

len(df)

943

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

In [ ]:
df.shape[0]

943

In [ ]:
df["age"].size

943

In [ ]:
df.describe() #devuelve la info pero solo de las que tienen valores numéricos

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [ ]:
df.describe(include="all") #de esta forma incluye todos los datos y te dice cuanto se repite, frecuencia, unicos y cuenta...

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [ ]:
df.describe().loc["count"]

age    943.0
Name: count, dtype: float64

### Step 7. What is the number of columns in the dataset?
Solve it by 2 different ways

In [ ]:
len(df.columns)

4

In [ ]:
df.info

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

In [ ]:
df.shape[1]

4

In [ ]:
conteo = 0
for elem in df.columns:
    conteo = conteo +1
print(conteo)

4

### Step 8. Print the name of all the columns.

In [ ]:
df.columns.values #Se pone .values porque si usamos solo el .columns se ve como índice y no se puede utilizar

array(['age', 'gender', 'occupation', 'zip_code'], dtype=object)

In [ ]:
df.keys().values

array(['age', 'gender', 'occupation', 'zip_code'], dtype=object)

In [ ]:
for col in df.columns:
    print(col)

age
gender
occupation
zip_code

### Step 9. How is the dataset indexed? Get the index values

In [ ]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?
Solve it by 2 different ways

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [ ]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column
Solve it by 2 different ways

In [ ]:
df["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
df.loc[:, "occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [ ]:
df.iloc[:, 2]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset? How many users per occupation are in the dataset?

In [ ]:
df.describe(include="all").loc["unique", "occupation"]

21

In [ ]:
len(df["occupation"].value_counts())

21

In [ ]:
df["occupation"].nunique()

21

In [ ]:
df["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [ ]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 13. What is the most frequent occupation?

In [ ]:
df["occupation"].mode()

0    student
Name: occupation, dtype: object

In [ ]:
df["occupation"].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [ ]:
df["occupation"].mode()[0]

'student'

In [ ]:
df["occupation"].value_counts().idxmax()

'student'

In [ ]:
df["occupation"].describe().loc["top"]

'student'

### Step 14. Summarize the DataFrame.

In [10]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [11]:
df.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [12]:
df.describe(include="object")

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

### Step 16. Summarize only the occupation column

In [13]:
df["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [14]:
df["age"].mean()

34.05196182396607

In [15]:
import numpy as np
np.mean(df["age"])

34.05196182396607

### Step 18. What is the age with least occurrence?

In [24]:
df["age"].value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64

In [27]:
pd.set_option("display.max_row", None) #sirve para mostrar todas las filas. Este método te permite seleccionar las opciones de

In [28]:
df["age"].value_counts()

30    39
25    38
22    37
28    36
27    35
26    34
24    33
29    32
20    32
23    28
32    28
35    27
21    27
33    26
31    25
19    23
44    23
39    22
40    21
36    21
42    21
48    20
51    20
50    20
49    19
37    19
18    18
38    17
34    17
45    15
17    14
47    14
43    13
53    12
46    12
55    11
41    10
60     9
57     9
15     6
56     6
52     6
16     5
13     5
54     4
59     3
61     3
14     3
65     3
63     3
58     3
70     3
62     2
68     2
64     2
69     2
7      1
66     1
11     1
10     1
73     1
Name: age, dtype: int64

In [30]:
pd.set_option("display.max_rows", 20)

In [31]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [23]:
df["age"].value_counts().iloc[0]

39

In [22]:
df["age"].min()

7

In [33]:
edades = df["age"].value_counts()

edades

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64

In [40]:
for edad in df["age"].value_counts().items():
    print(edad)

(30, 39)
(25, 38)
(22, 37)
(28, 36)
(27, 35)
(26, 34)
(24, 33)
(29, 32)
(20, 32)
(23, 28)
(32, 28)
(35, 27)
(21, 27)
(33, 26)
(31, 25)
(19, 23)
(44, 23)
(39, 22)
(40, 21)
(36, 21)
(42, 21)
(48, 20)
(51, 20)
(50, 20)
(49, 19)
(37, 19)
(18, 18)
(38, 17)
(34, 17)
(45, 15)
(17, 14)
(47, 14)
(43, 13)
(53, 12)
(46, 12)
(55, 11)
(41, 10)
(60, 9)
(57, 9)
(15, 6)
(56, 6)
(52, 6)
(16, 5)
(13, 5)
(54, 4)
(59, 3)
(61, 3)
(14, 3)
(65, 3)
(63, 3)
(58, 3)
(70, 3)
(62, 2)
(68, 2)
(64, 2)
(69, 2)
(7, 1)
(66, 1)
(11, 1)
(10, 1)
(73, 1)

In [34]:
edades.min()

1

In [35]:
edades[edades == edades.min()]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [38]:
df["occupation"] == "student" #esto es una mascara que te devuelve las ocupaciones y estudiantes

user_id
1      False
2      False
3      False
4      False
5      False
       ...
939     True
940    False
941     True
942    False
943     True
Name: occupation, Length: 943, dtype: bool

In [39]:
df[df["occupation"] == "student"]

         age gender occupation zip_code
user_id
9         29      M    student    01002
30         7      M    student    55436
32        28      F    student    78741
33        23      M    student    27510
36        19      F    student    93117
...      ...    ...        ...      ...
928       21      M    student    55408
933       28      M    student    48105
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[196 rows x 4 columns]

In [41]:
df.query('occupation == "student"')  #query es para hacer una consulta. Lo mejor es poner siempre afuera comillas simples y dentro dobles. porque si solo buscamos una columna tiene que llevar comillas simples.
#este método es mejor porque queda más profesional, además es más rápido cuando usamos más condicionales

         age gender occupation zip_code
user_id
9         29      M    student    01002
30         7      M    student    55436
32        28      F    student    78741
33        23      M    student    27510
36        19      F    student    93117
...      ...    ...        ...      ...
928       21      M    student    55408
933       28      M    student    48105
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[196 rows x 4 columns]